In [1]:
mysql://root:123456@127.0.0.1:3306;

In [2]:
select date_add(now(), interval 1 day) dd

,dd
0,2021-11-24 18:28:07

In [3]:
show databases;

,Database
0,information_schema
1,mysql
2,performance_schema
3,sys

In [12]:
CREATE DATABASE test;

In [13]:
USE test;

In [14]:
show databases;

,Database
0,information_schema
1,mysql
2,performance_schema
3,sys
4,test

In [15]:
SELECT user FROM mysql.user;

,user
0,root
1,mysql.infoschema
2,mysql.session
3,mysql.sys
4,root

In [16]:
CREATE TABLE table_name (
    column1 datatype,
    column2 datatype,
    column3 datatype,
);

In [17]:
create database movies;

In [19]:
use movies;

In [20]:
CREATE TABLE movies(title VARCHAR(50) NOT NULL,genre VARCHAR(30) NOT NULL,director VARCHAR(60) NOT NULL,release_year INT NOT NULL,PRIMARY KEY(title));

In [21]:
DESCRIBE movies;

,Field,Type,Null,Key,Default,Extra
0,title,varchar(50),NO,PRI,None,
1,genre,varchar(30),NO,,None,
2,director,varchar(60),NO,,None,
3,release_year,int,NO,,None,

In [22]:
INSERT INTO movies VALUE ("Joker", "psychological thriller", "Todd Phillips", 2019);

In [23]:
SELECT * FROM movies;

,title,genre,director,release_year
0,Joker,psychological thriller,Todd Phillips,2019